In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('StudentsPerformance_modified.csv')

In [3]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72.0,74.0
1,female,group C,some college,standard,completed,69,90.0,88.0
2,female,group B,master's degree,standard,none,90,95.0,93.0
3,male,group A,associate's degree,free/reduced,none,47,57.0,44.0
4,male,group C,some college,standard,none,76,78.0,75.0

In [4]:
df.tail()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
995,female,group E,master's degree,standard,completed,88,99.0,95.0
996,male,group C,high school,free/reduced,none,62,55.0,55.0
997,female,group C,high school,free/reduced,completed,59,71.0,65.0
998,female,group D,some college,standard,completed,68,78.0,77.0
999,female,group D,some college,free/reduced,none,77,86.0,86.0

In [5]:
df.isna().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
math score                     8
reading score                  6
writing score                  9
dtype: int64

In [6]:
df.dtypes

gender                          object
race/ethnicity                  object
parental level of education     object
lunch                           object
test preparation course         object
math score                      object
reading score                  float64
writing score                  float64
dtype: object

In [7]:
df['math score'] = pd.to_numeric(df['math score'],errors = 'coerce')

In [8]:
df['math score'].head()

0    72.0
1    69.0
2    90.0
3    47.0
4    76.0
Name: math score, dtype: float64

In [9]:
df['math score']

0      72.0
1      69.0
2      90.0
3      47.0
4      76.0
       ...
995    88.0
996    62.0
997    59.0
998    68.0
999    77.0
Name: math score, Length: 1000, dtype: float64

In [10]:
df['math score'].isna().sum()

43

In [11]:
df['math score'].fillna(df['math score'].mean(),inplace=True)

In [12]:
df['math score'].isna().sum()

0

In [14]:
df.isnull().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
math score                     0
reading score                  6
writing score                  9
dtype: int64

In [16]:
df['reading score'] = pd.to_numeric(df['reading score'], errors='coerce')

In [17]:
df['reading score'].isna().sum()

6

In [18]:
df['reading score'].fillna(df['reading score'].mean(),inplace=True)

In [19]:
df['reading score'].isna().sum()

0

In [20]:
df.describe()

        math score  reading score  writing score
count  1000.000000    1000.000000     991.000000
mean     66.323929      68.008048      69.487386
std      17.882376      16.552339      29.563757
min     -89.000000       3.000000      10.000000
25%      57.000000      58.000000      57.000000
50%      66.323929      69.000000      69.000000
75%      76.000000      79.000000      79.000000
max     334.000000     100.000000     567.000000

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   float64
 6   reading score                1000 non-null   float64
 7   writing score                991 non-null    float64
dtypes: float64(3), object(5)
memory usage: 62.6+ KB

In [22]:
df.dtypes

gender                          object
race/ethnicity                  object
parental level of education     object
lunch                           object
test preparation course         object
math score                     float64
reading score                  float64
writing score                  float64
dtype: object

In [23]:
df['gender'].value_counts()

female    518
male      482
Name: gender, dtype: int64

In [24]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72.0,72.0,74.0
1,female,group C,some college,standard,completed,69.0,90.0,88.0
2,female,group B,master's degree,standard,none,90.0,95.0,93.0
3,male,group A,associate's degree,free/reduced,none,47.0,57.0,44.0
4,male,group C,some college,standard,none,76.0,78.0,75.0

In [26]:
df.drop('race/ethnicity',axis=1,inplace=True)

In [27]:
df.head()

,gender,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,bachelor's degree,standard,none,72.0,72.0,74.0
1,female,some college,standard,completed,69.0,90.0,88.0
2,female,master's degree,standard,none,90.0,95.0,93.0
3,male,associate's degree,free/reduced,none,47.0,57.0,44.0
4,male,some college,standard,none,76.0,78.0,75.0

In [28]:
df['gender'] = df['gender'].replace(['female','male'],[0,1])

In [29]:
df.head()

,gender,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,0,bachelor's degree,standard,none,72.0,72.0,74.0
1,0,some college,standard,completed,69.0,90.0,88.0
2,0,master's degree,standard,none,90.0,95.0,93.0
3,1,associate's degree,free/reduced,none,47.0,57.0,44.0
4,1,some college,standard,none,76.0,78.0,75.0

In [31]:
df.dtypes

gender                           int64
parental level of education     object
lunch                           object
test preparation course         object
math score                     float64
reading score                  float64
writing score                  float64
dtype: object

In [32]:
df.drop('parental level of education',axis=1,inplace=True)

In [33]:
df.dtypes

gender                       int64
lunch                       object
test preparation course     object
math score                 float64
reading score              float64
writing score              float64
dtype: object

In [34]:
df.head()

,gender,lunch,test preparation course,math score,reading score,writing score
0,0,standard,none,72.0,72.0,74.0
1,0,standard,completed,69.0,90.0,88.0
2,0,standard,none,90.0,95.0,93.0
3,1,free/reduced,none,47.0,57.0,44.0
4,1,standard,none,76.0,78.0,75.0

In [35]:
df['lunch'] = df['lunch'].replace(['standard','free/reduced'],[0,1])

In [36]:
df['test preparation course'] = df['test preparation course'].replace(['none','completed'],[0,1])

In [38]:
df.dtypes

gender                       int64
lunch                        int64
test preparation course      int64
math score                 float64
reading score              float64
writing score              float64
dtype: object

In [40]:
df

,gender,lunch,test preparation course,math score,reading score,writing score
0,0,0,0,72.0,72.0,74.0
1,0,0,1,69.0,90.0,88.0
2,0,0,0,90.0,95.0,93.0
3,1,1,0,47.0,57.0,44.0
4,1,0,0,76.0,78.0,75.0
...,...,...,...,...,...,...
995,0,0,1,88.0,99.0,95.0
996,1,1,0,62.0,55.0,55.0
997,0,1,1,59.0,71.0,65.0
998,0,0,1,68.0,78.0,77.0
999,0,1,0,77.0,86.0,86.0